/* График функции y = f(x) задан точками,
соединенными прямыми отрезками.
Вот эти точки: (–oo, 0),  (–2, 0),  (–1, –1),
(1, 1),  (2, 0),  (+oo, 0).
Ввести с клавиатуры вещественное (double)
значение x, напечатать соответствующее значение y.
*/
#include <iostream>

using namespace std;

int main()
{
    double x,x1=0,x0=0;   double y,y1=0,y0=0;
    cout << "print x\n";
    cin >> x;
   
    if (x < -2) { x0 = x; x1 = -2; y0 = y1 = 0; }
    if ((x > -1) && (x < 1)) { x0 = -1; x1 = 1; y0 = -1; y1 = 1; }
    if ((x > -2) && (x < -1)) { x0 = -2; x1 = -1; y0 = 0; y1 = -1; }
     if( (x > 1) && (x < 2)) { x0 = 1; y0 = 1; x1 = 2; y1 = 0; }
y = ((y1 - y0) / (x1 - x0)) * (x - x0) + y0;

    
    if (x == 1) { y = 1; }
    if (x == -1) { y = -1; }
    if (x >= 2) { y = 0; }
    if (x == -2) { y = 0; }
cout << "y=\n";
cout << y;

 //
 
    
   
    
}
